LUCK_DATA = {
    1: {
        "name": "东京浅草寺观音灵签第一签-大吉",
        "image_file": "1.jpg",
        "explain": ["❃ 愿望：会充分地实现吧。", "❃ 疾病：会治愈吧。", "❃ 盼望的人：会出现吧。", "❃ 遗失物：变得迟迟地才找到吧。", "❃ 盖新居、搬家、嫁娶、旅行、交往等：全部很好吧。万事行为谨慎。粗心大意行事的话，就会发生意想之外的灾害吧。"]
    },
    2: {
        "name": "东京浅草寺观音灵签第二签-小吉",
        "image_file": "2.jpg",
        "explain": ["❃ 愿望：因为持续不断地努力，必定会实现。", "❃ 疾病：虽然拖长，但是之后可以康复吧。", "❃ 盼望的人：迟迟地才出现吧。", "❃ 遗失物：不能找出来吧。", "❃ 交往：要节制吧。", "❃ 盖新居、搬家：都不坏吧。", "❃ 结亲缘、旅行：顺利进行吧。"]
    },
    3: {
        "name": "东京浅草寺观音灵签第三签-凶",
        "image_file": "3.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：虽然拖长，但是会治好吧。", "❃ 遗失物：难以找到吧。", "❃ 盼望的人：要花很久的时间吧。", "❃ 旅行：因为很坏，放弃吧。", "❃ 盖新居、搬家：勉勉强强地算好吧。", "❃ 结婚、交往：要节制吧。"]
    },
    4: {
        "name": "东京浅草寺观音灵签第四签-吉",
        "image_file": "4.jpg",
        "explain": ["❃ 愿望：能实现吧。如果这样的话，终生幸福吧。", "❃ 疾病：变得迟迟地才会治好吧。", "❃ 遗失物：迟迟地才找到吧。", "❃ 盼望的人：会出现吧。", "❃ 旅行：途中要忍耐各式各样的困难吧。", "❃ 盖新居、搬家、结亲缘、交往：万事都好吧。"]
    },
    5: {
        "name": "东京浅草寺观音灵签第五签-凶",
        "image_file": "5.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：难治好吧。", "❃ 遗失物：难找到吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：先放弃，暂时观察情况再说吧。", "❃ 结亲缘、旅行、交往：因为万事凶恶，请诸行为慎重行事。"]
    },
    6: {
        "name": "东京浅草寺观音灵签第六签-末吉",
        "image_file": "6.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：康复很花时间吧。", "❃ 遗失物：难找到吧。", "❃ 盼望的人：迟迟地才出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结亲缘、交往：坏吧。"]
    },
    7: {
        "name": "东京浅草寺观音灵签第七签-凶",
        "image_file": "7.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：难以治愈吧。", "❃ 遗失物：难以找到吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：换时间吧。", "❃ 结亲缘、喜庆祝贺、旅行、交往：不好吧。"]
    },
    8: {
        "name": "东京浅草寺观音灵签第八签-大吉",
        "image_file": "8.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好。请注意养生吧。", "❃ 遗失物：可以找到吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家、交往：是好事吧。", "❃ 旅行：途中请不要粗心大意吧。", "❃ 结亲缘：全都是好的吧。"]
    },
    9: {
        "name": "东京浅草寺观音灵签第九签-大吉",
        "image_file": "9.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会找到吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 结亲缘、交往：全都好吧。", "❃ 旅行：没问题吧。"]
    },
    10: {
        "name": "东京浅草寺观音灵签第十签-大吉",
        "image_file": "10.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：立刻会找到吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：会变为好结果吧。", "❃ 结亲缘、旅行、交往：全部变为好结果吧。"]
    },
    11: {
        "name": "东京浅草寺观音灵签第十一签-大吉",
        "image_file": "11.jpg",
        "explain": ["❃ 愿望：会充分地实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会找到吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：没问题吧。", "❃ 结婚、交往：全部都能得到好结果吧。"]
    },
    12: {
        "name": "东京浅草寺观音灵签第十二签-大吉",
        "image_file": "12.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会变好吧。", "❃ 遗失物：会回来吧。", "❃ 盼望的人：晚出现吧。", "❃ 盖新居、搬家：会成为好结果吧。", "❃ 旅行：没有阻碍吧。", "❃ 结婚、交往：全都适当吧。"]
    },
    13: {
        "name": "东京浅草寺观音灵签第十三签-大吉",
        "image_file": "13.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：立刻找就能找到吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：在春天和夏天好吧。", "❃ 结婚、交往：全部都好吧。"]
    },
    14: {
        "name": "东京浅草寺观音灵签第十四签-末吉",
        "image_file": "14.jpg",
        "explain": ["❃ 愿望：很花时间但会实现吧。", "❃ 疾病：会拖长吧，但是不会影响性命吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：似乎会变得迟吧。", "❃ 盖新居、搬家：不太好吧。结婚：现在要节制，如果往后的话好吧。", "❃ 旅行、交往：避开吧。"]
    },
    15: {
        "name": "东京浅草寺观音灵签第十五签-凶",
        "image_file": "15.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：危险吧。", "❃ 遗失物：难找回吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：都不好吧。", "❃ 旅行、结亲缘：坏吧。"]
    },
    16: {
        "name": "东京浅草寺观音灵签第十六签-吉",
        "image_file": "16.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：会康复吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会来吧。", "❃ 盖新居、搬家：会有好结果吧。", "❃ 旅行：好吧。", "❃ 结亲缘、交往：全部会变成好结果吧。"]
    },
    17: {
        "name": "东京浅草寺观音灵签第十七签-凶",
        "image_file": "17.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：康复需要长时间吧。", "❃ 遗失物：不会出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：先放弃，暂时观察情况再说吧。", "❃ 旅行：似乎引起坏的结果吧。婚事、交往：全部不好吧。"]
    },
    18: {
        "name": "东京浅草寺观音灵签第十八签-吉",
        "image_file": "18.jpg",
        "explain": ["❃ 愿望：会实践吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结亲缘、交往：全部变为好结果吧。"]
    },
    19: {
        "name": "东京浅草寺观音灵签第十九签-末小吉",
        "image_file": "19.jpg",
        "explain": ["❃ 愿望：能实现一半吧。", "❃ 疾病：虽然长期得病，但是不会危及性命吧。", "❃ 遗失物：大概找回不来了吧。", "❃ 盼望的人：变成迟迟地出现吧。", "❃ 盖新居、搬家：不好也不坏吧。", "❃ 旅行：节制比较好吧。结婚：不会到达好的结果吧。", "❃ 交往：节制吧。"]
    },
    20: {
        "name": "东京浅草寺观音灵签第二十签-吉",
        "image_file": "20.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会来吧。", "❃ 盖新居、搬家：好吧。", "❃ 结婚、交往：全部都得到好结果吧。", "❃ 旅行：好吧。"]
    },
    21: {
        "name": "东京浅草寺观音灵签第二十一签-吉",
        "image_file": "21.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：虽然会恢复但是切忌粗心大意。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。结婚：会得到好结果吧。", "❃ 旅行、交往：全部好吧。"]
    },
    22: {
        "name": "东京浅草寺观音灵签第二十二签-吉",
        "image_file": "22.jpg",
        "explain": ["❃ 愿望：虽然能被实现，但是变得比较晚吧。", "❃ 疾病：因为会治好，耐心等待康复吧。", "❃ 遗失物：虽然会出现但很迟吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 结婚、旅行、交往：全都好吧。"]
    },
    23: {
        "name": "东京浅草寺观音灵签第二十三签-吉",
        "image_file": "23.jpg",
        "explain": ["❃ 愿望：虽然会实现，但是要考虑能力吧。", "❃ 疾病：难以康复吧。", "❃ 遗失物：难以找到吧。", "❃ 盼望的人：不能出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 结婚、交往：好吧。", "❃ 旅行：没问题吧。"]
    },
    24: {
        "name": "东京浅草寺观音灵签第二十四签-凶",
        "image_file": "24.jpg",
        "explain": ["❃ 愿望：不会实现吧。", "❃ 疾病：虽然拖很长，但会治好吧。", "❃ 遗失物：变成到后来才找到吧。", "❃ 盼望的人：不能出现吧。", "❃ 盖新居、搬家：不好吧。", "❃ 旅行：不好吧。", "❃ 结婚、交往：变成不好的结果吧。"]
    },
    25: {
        "name": "东京浅草寺观音灵签第二十五签-吉",
        "image_file": "25.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：迟迟才来吧。", "❃ 盖新居、搬家：似乎没问题。", "❃ 结婚、旅行、交往：全部都变成好结果吧。"]
    },
    26: {
        "name": "东京浅草寺观音灵签第二十六签-吉",
        "image_file": "26.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：会变成好结果吧。"]
    },
    27: {
        "name": "东京浅草寺观音灵签第二十七签-吉",
        "image_file": "27.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧，但切忌粗心大意。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：非常好吧。", "❃ 结婚、交往：全部都变成好结果吧。"]
    },
    28: {
        "name": "东京浅草寺观音灵签第二十八签-凶",
        "image_file": "28.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：如果长期养生的话会治好吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：变得迟迟地才出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 结婚、交往：坏吧。"]
    },
    29: {
        "name": "东京浅草寺观音灵签第二十九签-吉",
        "image_file": "29.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 结婚、交往：全都好吧。"]
    },
    30: {
        "name": "东京浅草寺观音灵签第三十签-半吉",
        "image_file": "30.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：危险吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：如果能祈求神佛的保佑，会变成勉强可以的结果吧。", "❃ 旅行：坏吧。", "❃ 结婚、交往：节制吧。"]
    },
    31: {
        "name": "东京浅草寺观音灵签第三十一签-末吉",
        "image_file": "31.jpg",
        "explain": ["❃ 愿望：虽能被实现，但要考虑时机吧。", "❃ 疾病：拖很久吧。", "❃ 遗失物：变得迟迟地才出现吧。", "❃ 盼望的人：变得迟迟地才出现吧。", "❃ 盖新居、搬家：没阻碍吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    32: {
        "name": "东京浅草寺观音灵签第三十二签-吉",
        "image_file": "32.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：虽然会拖长，但是不会失去生命。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：变得迟迟地才出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 结婚、交往：全部和好结果有关吧。"]
    },
    33: {
        "name": "东京浅草寺观音灵签第三十三签-吉",
        "image_file": "33.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：没有阻碍吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全都好吧。"]
    },
    34: {
        "name": "东京浅草寺观音灵签第三十四签-吉",
        "image_file": "34.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：迟迟才出现吧。", "❃ 盼望的人：迟吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全都和好结果相连吧。"]
    },
    35: {
        "name": "东京浅草寺观音灵签第三十五签-吉",
        "image_file": "35.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：变迟才出现吧。", "❃ 盖新居、搬家：没有障碍吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    36: {
        "name": "东京浅草寺观音灵签第三十六签-末吉。",
        "image_file": "36.jpg",
        "explain": ["❃ 愿望：稍后会实现吧。", "❃ 疾病：虽然拖长，但可以治愈吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：迟迟地才出现吧。", "❃ 盖新居、搬家：应该先放弃，暂时多观察情况再说吧。", "❃ 旅行：途中，似乎会有不好的事吧。", "❃ 结亲缘、喜庆、交往：不好吧。"]
    },
    37: {
        "name": "东京浅草寺观音灵签第三十七签-半吉",
        "image_file": "37.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：变成迟迟地才好转吧。", "❃ 遗失物：变成迟迟地才出现吧。", "❃ 盼望的人：变成迟迟地才出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：往后一点，变成好吧。"]
    },
    38: {
        "name": "东京浅草寺观音灵签第三十八签半吉",
        "image_file": "38.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：会拖长吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：不好也不坏吧。", "❃ 旅行：先放弃，暂时观察情况再说吧。", "❃ 结婚、交往：先放弃，暂时观察情况吧。"]
    },
    39: {
        "name": "东京浅草寺观音灵签第三十九签-凶",
        "image_file": "39.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：又坏又危险吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：避开比较好吧。", "❃ 旅行：不好吧。", "❃ 结婚、交往：招致坏结果吧。"]
    },
    40: {
        "name": "东京浅草寺观音灵签第四十签-小吉",
        "image_file": "40.jpg",
        "explain": ["❃ 愿望：难以立刻地实现吧。", "❃ 疾病：虽然拖长但会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：变成迟迟才地出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：不好也不坏吧。"]
    },
    41: {
        "name": "东京浅草寺观音灵签第四十一签-末吉",
        "image_file": "41.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：会拖长吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：变成迟迟地才出现吧。", "❃ 盖新居、搬家：不好吧。", "❃ 旅行：途中似乎有不好的事。", "❃ 结婚、交往：会产生不好的结果吧。"]
    },
    42: {
        "name": "东京浅草寺观音灵签第四十二签-吉",
        "image_file": "42.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治愈吧。", "❃ 遗失物：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 盼望的人：变成迟迟地才出现吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全都会变成好结果吧。"]
    },
    43: {
        "name": "东京浅草寺观音灵签第四十三签-吉",
        "image_file": "43.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：虽然拖长但是会治好吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：变成迟迟地才出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：变成好结果吧。"]
    },
    44: {
        "name": "东京浅草寺观音灵签第四十四签吉",
        "image_file": "44.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治愈吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：变成迟迟地才出现吧。", "❃ 盖新居、搬家：没问题吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全都好吧。"]
    },
    45: {
        "name": "东京浅草寺观音灵签第四十五签-吉",
        "image_file": "45.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：迟迟地才出现吧。", "❃ 盼望的人：变迟迟地才出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全都好结果相连吧。"]
    },
    46: {
        "name": "东京浅草寺观音灵签第四十六签-凶",
        "image_file": "46.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：现在放弃吧。", "❃ 旅行：在途中有不好的事吧。", "❃ 结婚、交往：会产生不好的结果吧。"]
    },
    47: {
        "name": "东京浅草寺观音灵签第四十七签-吉",
        "image_file": "47.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：变成往后才会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：变得迟迟才出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：在将来似乎有好事吧。", "❃ 结婚、交往：全部都可得到好结果吧。"]
    },
    48: {
        "name": "东京浅草寺观音灵签第四十八签-小吉",
        "image_file": "48.jpg",
        "explain": ["❃ 愿望：如果一直抱持着正直的心的话，到后来能被实现吧。", "❃ 疾病：虽然拖长，但将来会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：变成迟迟才来吧。", "❃ 盖新居、搬家：虽然开始不好，但是到后来会变好吧。", "❃ 结婚、交往、旅行：马马虎虎吧。"]
    },
    49: {
        "name": "东京浅草寺观音灵签第四十九签-吉",
        "image_file": "49.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：严重吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：变成迟迟才出现吧。", "❃ 盖新居、搬家：马马虎虎吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：马马虎虎吧。"]
    },
    50: {
        "name": "东京浅草寺观音灵签第五十签-吉",
        "image_file": "50.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：变迟吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：成为好的旅行吧。", "❃ 结婚、交往：成为好的结果吧。"]
    },
    51: {
        "name": "东京浅草寺观音灵签第五十一签-吉",
        "image_file": "51.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：变成往后才治好吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：变晚吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好事吧。", "❃ 结婚、交往：会得到好结果吧。"]
    },
    52: {
        "name": "东京浅草寺观音灵签第五十二签-凶",
        "image_file": "52.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：会拖长吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：马马虎虎还算有点好吧。", "❃ 旅行：因为不好，避开吧。", "❃ 结婚、交往：不好也不坏吧。"]
    },
    53: {
        "name": "东京浅草寺观音灵签第五十三签-吉",
        "image_file": "53.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：变得迟迟才找到吧。", "❃ 盼望的人：迟迟地才出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：变成好的旅行吧。", "❃ 结婚、交往：全都朝向好的方向发展吧。"]
    },
    54: {
        "name": "东京浅草寺观音灵签第五十四签-凶",
        "image_file": "54.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：危险吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：暂时放弃，再观察看看吧。", "❃ 结婚、交往：变成坏结果吧。"]
    },
    55: {
        "name": "东京浅草寺观音灵签第五十五签-吉",
        "image_file": "55.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会找到吧。", "❃ 盼望的人：变迟吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全都好吧。"]
    },
    56: {
        "name": "东京浅草寺观音灵签第五十六签-末小吉",
        "image_file": "56.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：变成迟迟才治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：迟迟才出现吧。", "❃ 盖新居、搬家：半吉吧。", "❃ 旅行：如果有一起同行的人的话好（安全）吧。", "❃ 结婚、交往：马马虎虎还可以吧。"]
    },
    57: {
        "name": "东京浅草寺观音灵签第五十七签-吉",
        "image_file": "57.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：虽然会治好，但会拖长吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：变迟迟才出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：坏吧。", "❃ 结婚、交往：马马虎虎还可以吧。"]
    },
    58: {
        "name": "东京浅草寺观音灵签第五十八签-凶",
        "image_file": "58.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：不能安心吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：中止吧。", "❃ 结婚、交往、旅行：坏吧。"]
    },
    59: {
        "name": "东京浅草寺观音灵签第五十九签-凶",
        "image_file": "59.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：危险吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：似乎会发生坏事吧。", "❃ 结婚、交往：得到坏结果吧。"]
    },
    60: {
        "name": "东京浅草寺观音灵签第六十签-小吉",
        "image_file": "60.jpg",
        "explain": ["❃ 愿望：如果正心而行的话会实现吧。", "❃ 疾病：会拖长吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：不好吧。", "❃ 旅行：马马虎虎地算好吧。", "❃ 结婚、交往：马马虎虎地算好吧。"]
    },
    61: {
        "name": "东京浅草寺观音灵签第六十一签-半吉",
        "image_file": "61.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：会拖长吧。", "❃ 遗失物：难找到吧。", "❃ 盼望的人：变迟吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：坏吧。", "❃ 结婚、交往：不好吧。"]
    },
    62: {
        "name": "东京浅草寺观音灵签第六十二签-大吉",
        "image_file": "62.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：没问题吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全都好吧。"]
    },
    63: {
        "name": "东京浅草寺观音灵签第六十三签-凶",
        "image_file": "63.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：难治愈吧。", "❃ 遗失物：难找到吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：似乎会发生坏事吧。", "❃ 结婚、交往：会产生坏结果吧。"]
    },
    64: {
        "name": "东京浅草寺观音灵签第六十四签-凶",
        "image_file": "64.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：危险吧。", "❃ 遗失物：不会出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：还可以吧。", "❃ 旅行：还可以吧。", "❃ 结婚、交往：不好吧。"]
    },
    65: {
        "name": "东京浅草寺观音灵签第六十五签-末吉",
        "image_file": "65.jpg",
        "explain": ["❃ 愿望：以后会实现吧。", "❃ 疾病：虽然拖长但会治好吧。", "❃ 遗失物：不会出现吧。", "❃ 盼望的人：变得迟迟才出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：安全吧。", "❃ 结婚、交往：得到还可以的好结果吧。"]
    },
    66: {
        "name": "东京浅草寺观音灵签第六十六签-凶",
        "image_file": "66.jpg",
        "explain": ["❃ 愿望：难实现。", "❃ 疾病：可疑，不明朗吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：坏吧。", "❃ 结婚、交往：坏吧。"]
    },
    67: {
        "name": "东京浅草寺观音灵签第六十七签-凶",
        "image_file": "67.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：会拖长吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：多比较看看比较好吧。", "❃ 旅行：不好吧。", "❃ 结婚、交往：坏吧。"]
    },
    68: {
        "name": "东京浅草寺观音灵签第六十八签-吉",
        "image_file": "68.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出来吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全都好吧。"]
    },
    69: {
        "name": "东京浅草寺观音灵签第六十九签-凶",
        "image_file": "69.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：切忌粗心大意。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：放弃吧。", "❃ 结婚、交往：坏吧。"]
    },
    70: {
        "name": "东京浅草寺观音灵签第七十签-凶",
        "image_file": "70.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：不能安心吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：避免吧。", "❃ 结婚、旅行、交往：万事坏吧。"]
    },
    71: {
        "name": "东京浅草寺观音灵签第七十一签-凶",
        "image_file": "71.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：会拖长吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 结婚、旅行、交往：产生坏的结果吧。"]
    },
    72: {
        "name": "东京浅草寺观音灵签第七十二签-吉",
        "image_file": "72.jpg",
        "explain": ["❃ 愿望：后来会实现吧。", "❃ 疾病：会拖长吧。", "❃ 遗失物：变成迟迟才能找到吧。", "❃ 盼望的人：迟迟才出现吧。", "❃ 盖新居、搬家：还算好吧。", "❃ 旅行：没有特别的阻碍吧。", "❃ 结婚、交往：虽然还算好，但最后变得更好吧。"]
    },
    73: {
        "name": "东京浅草寺观音灵签第七十三签-吉",
        "image_file": "73.jpg",
        "explain": ["❃ 愿望：变得往后才能被实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出来吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全都好吧。"]
    },
    74: {
        "name": "东京浅草寺观音灵签第七十四签-凶",
        "image_file": "74.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：不能安心吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 结婚、旅行、交往：坏吧。"]
    },
    75: {
        "name": "东京浅草寺观音灵签第七十五签-凶",
        "image_file": "75.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：陷入的话（若是病人的话）危险吧。", "❃ 遗失物：不能找回来吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：坏吧。", "❃ 结婚、交往：坏吧。"]
    },
    76: {
        "name": "东京浅草寺观音灵签第七十六签-吉",
        "image_file": "76.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出来吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全部都好吧。"]
    },
    77: {
        "name": "东京浅草寺观音灵签第七十七签-凶",
        "image_file": "77.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：不能安心吧。", "❃ 遗失物：难找到吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：坏吧。", "❃ 结婚、交往：坏吧。"]
    },
    78: {
        "name": "东京浅草寺观音灵签第七十八签-大吉",
        "image_file": "78.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出来吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。"]
    },
    79: {
        "name": "东京浅草寺观音灵签第七十九签-吉",
        "image_file": "79.jpg",
        "explain": ["❃ 愿望：虽然能被实现但是大愿望不行吧。", "❃ 疾病：虽然会拖长，但会治好吧。", "❃ 遗失物：迟迟地才找到吧。", "❃ 盼望的人：变迟才出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    80: {
        "name": "东京浅草寺观音灵签第八十签-大吉",
        "image_file": "80.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：是好的，因为全部都保持谦虚的姿态，所以会招来好结果吧。"]
    },
    81: {
        "name": "东京浅草寺观音灵签第八十一签-小吉",
        "image_file": "81.jpg",
        "explain": ["❃ 愿望：如果保持端正的心的话，会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    82: {
        "name": "东京浅草寺观音灵签第八十二签-凶",
        "image_file": "82.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：可疑，不明朗吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：多比较看看比较好吧。", "❃ 结婚、交往：全都坏吧。"]
    },
    83: {
        "name": "东京浅草寺观音灵签第八十三签-凶",
        "image_file": "83.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：会拖长吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：危险吧。", "❃ 结婚、交往：产生坏结果吧。"]
    },
    84: {
        "name": "东京浅草寺观音灵签第八十四签-凶",
        "image_file": "84.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：危险吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：不好吧。", "❃ 结婚、交往：全部都产生坏的结果吧。"]
    },
    85: {
        "name": "东京浅草寺观音灵签第八十五签-大吉",
        "image_file": "85.jpg",
        "explain": ["❃ 愿望：变成往后才会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    86: {
        "name": "东京浅草寺观音灵签第八十六签-大吉",
        "image_file": "86.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全都好吧。"]
    },
    87: {
        "name": "东京浅草寺观音灵签第八十七签-大吉",
        "image_file": "87.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 结婚、交往：好吧。"]
    },
    88: {
        "name": "东京浅草寺观音灵签第八十八签-凶",
        "image_file": "88.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：危险吧。", "❃ 遗失物：不会出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：坏吧。", "❃ 结婚、交往：坏吧。"]
    },
    89: {
        "name": "东京浅草寺观音灵签第八十九签-大吉",
        "image_file": "89.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：不会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    90: {
        "name": "东京浅草寺观音灵签第九十签-大吉",
        "image_file": "90.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全部都好吧。"]
    },
    91: {
        "name": "东京浅草寺观音灵签第九十一签-吉",
        "image_file": "91.jpg",
        "explain": ["❃ 愿望：如果守正道的话会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    92: {
        "name": "东京浅草寺观音灵签第九十二签-吉",
        "image_file": "92.jpg",
        "explain": ["❃ 愿望：会实现吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    93: {
        "name": "东京浅草寺观音灵签第九十三签-吉",
        "image_file": "93.jpg",
        "explain": ["❃ 愿望：变成到后来能实现吧。", "❃ 疾病：会拖长吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：变迟吧。", "❃ 盖新居、搬家：马马虎虎还算可以吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    94: {
        "name": "东京浅草寺观音灵签第九十四签-半吉",
        "image_file": "94.jpg",
        "explain": ["❃ 愿望：不能按照所想的实现吧。", "❃ 疾病：虽然会拖长但是不会危害生命吧。要特别用心维持健康吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：不好吧。", "❃ 旅行：马马虎虎还算可以吧。", "❃ 结婚、交往：勉强还算可以吧。"]
    },
    95: {
        "name": "东京浅草寺观音灵签第九十五签-吉",
        "image_file": "95.jpg",
        "explain": ["❃ 愿望：能被实现吧。", "❃ 疾病：变成迟迟才治好吧。", "❃ 遗失物：变成迟迟地才出现吧。", "❃ 盼望的人：迟迟地才出现吧。", "❃ 盖新居、搬家：没有阻碍吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    96: {
        "name": "东京浅草寺观音灵签第九十六签-大吉",
        "image_file": "96.jpg",
        "explain": ["❃ 愿望：能被实现吧。但是，抱持全面谨慎的心是很重要的。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：全部好吧。"]
    },
    97: {
        "name": "东京浅草寺观音灵签第九十七签-凶",
        "image_file": "97.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：危险吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：不好吧。", "❃ 结婚、交往：坏吧。"]
    },
    98: {
        "name": "东京浅草寺观音灵签第九十八签-凶",
        "image_file": "98.jpg",
        "explain": ["❃ 愿望：难以实现吧。", "❃ 疾病：可疑，不明朗吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：不会出现吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：坏吧。", "❃ 结婚、交往：坏吧。"]
    },
    99: {
        "name": "东京浅草寺观音灵签第九十九签-大吉",
        "image_file": "99.jpg",
        "explain": ["❃ 愿望：能被实现吧。在万事中要用谦虚的心吧。", "❃ 疾病：会治好吧。", "❃ 遗失物：会出现吧。", "❃ 盼望的人：会出现吧。", "❃ 盖新居、搬家：好吧。", "❃ 旅行：好吧。", "❃ 结婚、交往：好吧。"]
    },
    100: {
        "name": "东京浅草寺观音灵签第一百签-凶",
        "image_file": "100.jpg",
        "explain": ["❃ 愿望：难实现吧。", "❃ 疾病：危险吧。", "❃ 遗失物：难出现吧。", "❃ 盼望的人：坏吧。", "❃ 盖新居、搬家：坏吧。", "❃ 旅行：坏吧。", "❃ 结婚、交往：全部坏吧。"]
    }
}