DATA_CENTER_NAMES = {
    '中国': '中国',
    '国区': '中国',
    '陆行鸟': '陆行鸟',
    '莫古力': '莫古力',
    '猫小胖': '猫小胖',
    '豆豆柴': '豆豆柴',
    '鸟区': '陆行鸟',
    '猪区': '莫古力',
    '猫区': '猫小胖',
    '狗区': '豆豆柴',
    '鸟': '陆行鸟',
    '猪': '莫古力',
    '猫': '猫小胖',
    '狗': '豆豆柴',
}

WORLD_NAMES = {
    '红玉海',
    '神意之地',
    '拉诺西亚',
    '幻影群岛',
    '萌芽池',
    '宇宙和音',
    '沃仙曦染',
    '晨曦王座',
    '白银乡',
    '白金幻象',
    '神拳痕',
    '潮风亭',
    '旅人栈桥',
    '拂晓之间',
    '龙巢神殿',
    '梦羽宝境',
    '紫水栈桥',
    '延夏',
    '静语庄园',
    '摩杜纳',
    '海猫茶屋',
    '柔风海湾',
    '琥珀原',
    '水晶塔',
    '银泪湖',
    '太阳海岸',
    '伊修加德',
    '红茶川',
    '黄金谷',
    '月牙湾',
    '雪松原',
}


# universalis api 数据格式
# {
#     "minPrice": 5962, # 当前最低单价
#     "maxPrice": 83998, # 当前最高单价
#     "averagePrice": 7128.9365, # 当前平均单价
#     "lastUploadTime": 1663307715286, # 更新时间
#     "listings": [{ # 板子价格
#         "lastReviewTime": 1663210622, # 最后检查时间
#         "pricePerUnit": 5962, # 单价
#         "quantity": 20, # 数量
#         "worldName": "\u62c2\u6653\u4e4b\u95f4", # 世界名称
#         "hq": False, # 是否HQ品质
#         "retainerName": "Aaaaa\u9171", # 销售者名称
#         "total": 119238 #总价
#     }, {
#         "lastReviewTime": 1663210622,
#         "pricePerUnit": 5962,
#         "quantity": 20,
#         "worldName": "\u62c2\u6653\u4e4b\u95f4",
#         "hq": False,
#         "retainerName": "Aaaaa\u9171",
#         "total": 119238
#     }],
#     "recentHistory": [{ # 最近销售记录
#         "hq": False, # 是否HQ品质
#         "pricePerUnit": 6410, # 单价
#         "quantity": 3, # 数量
#         "timestamp": 1663273595, # 出售时间
#         "worldName": "\u767d\u91d1\u5e7b\u8c61", # 世界名称
#         "buyerName": "\u80f6\u5e03\u4fa6\u63a2", # 购买者名称
#         "total": 19230
#     }, {
#         "hq": False,
#         "pricePerUnit": 6409,
#         "quantity": 1,
#         "timestamp": 1663273593,
#         "worldName": "\u767d\u91d1\u5e7b\u8c61",
#         "buyerName": "\u80f6\u5e03\u4fa6\u63a2",
#         "total": 6409
#     }]
# }

# 莫古力 <神眼魔晶石拾型> 交易板数据如下:
# ======================
# 最低单价: 5962 / 最高单价: 6203
# 平均单价: 7128
# ======================
# 5962 x 10 = 59620    龙巢神殿
# 5962 x 100 = 596200    拂晓之间
# 5962 x 100 = 596200    龙巢神殿
# 5962 x 100 = 596200    龙巢神殿
# 5962 x 100 = 596200    龙巢神殿
# 5962 x 100 = 596200    龙巢神殿
# 5962 x 100 = 596200    龙巢神殿
# 5962 x 100 = 596200    龙巢神殿
# 5962 x 100 = 596200    龙巢神殿
# 5962 x 100 = 596200    龙巢神殿
# ======================
# 更新时间:2022-09-16 14:12:00
